{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "BlipForConditionalGeneration",
    "parent_library": "transformers.models.blip.modeling_blip"
  },
  "base_model_name_or_path": "Salesforce/blip-image-captioning-base",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "vision_model.encoder.layers.9.self_attn.qkv",
    "text_decoder.bert.encoder.layer.5.attention.self.query",
    "vision_model.encoder.layers.7.self_attn.qkv",
    "text_decoder.bert.encoder.layer.6.attention.self.value",
    "vision_model.encoder.layers.8.self_attn.qkv",
    "vision_model.encoder.layers.6.self_attn.qkv",
    "text_decoder.bert.encoder.layer.6.attention.self.key",
    "text_decoder.bert.encoder.layer.5.attention.self.key",
    "text_decoder.bert.encoder.layer.6.attention.self.query",
    "text_decoder.bert.encoder.layer.5.attention.self.value"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}